-- MySQL dump 10.13  Distrib 5.7.17, for macos10.12 (x86_64)
--
-- Host: localhost    Database: weibodb
-- ------------------------------------------------------
-- Server version	5.7.10

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `keywords`
--

DROP TABLE IF EXISTS `keywords`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `keywords` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `topic` varchar(120) DEFAULT NULL,
  `word` varchar(120) DEFAULT NULL,
  `weight` float DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=61 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `keywords`
--

LOCK TABLES `keywords` WRITE;
/*!40000 ALTER TABLE `keywords` DISABLE KEYS */;
INSERT INTO `keywords` VALUES (1,'#北京电影学院性侵案#','侵案',0.0158261),(2,'#北京电影学院性侵案#','老师',0.0115027),(3,'#北京电影学院性侵案#','学生',0.00735204),(4,'#北京电影学院性侵案#','北京电影学院',0.00686685),(5,'#北京电影学院性侵案#','没有',0.00497883),(6,'#北京电影学院性侵案#','希望',0.00478932),(7,'#北京电影学院性侵案#','事情',0.00465896),(8,'#北京电影学院性侵案#','现在',0.00454153),(9,'#北京电影学院性侵案#','出来',0.00424213),(10,'#北京电影学院性侵案#','学校',0.00423867),(11,'#北京电影学院性侵案#','阿廖沙',0.00396032),(12,'#北京电影学院性侵案#','知道',0.00380595),(13,'#北京电影学院性侵案#','事件',0.00367812),(14,'#北京电影学院性侵案#','大学',0.00356958),(15,'#北京电影学院性侵案#','社会',0.00323548),(16,'#北京电影学院性侵案#','应该',0.00318013),(17,'#北京电影学院性侵案#','联名',0.00304186),(18,'#北京电影学院性侵案#','世界',0.00300848),(19,'#北京电影学院性侵案#','北影',0.00295761),(20,'#北京电影学院性侵案#','觉得',0.00295535),(21,'#北京电影学院性侵案#','同学',0.00267248),(22,'#北京电影学院性侵案#','相信',0.0026408),(23,'#北京电影学院性侵案#','北电',0.00262204),(24,'#北京电影学院性侵案#','不会',0.00258409),(25,'#北京电影学院性侵案#','受害者',0.00238472),(26,'#北京电影学院性侵案#','恶心',0.00234113),(27,'#北京电影学院性侵案#','法律',0.00227976),(28,'#北京电影学院性侵案#','女生',0.00226675),(29,'#北京电影学院性侵案#','不能',0.00221642),(30,'#北京电影学院性侵案#','受到',0.00212039),(31,'#校园网大规模病毒攻击#','攻击',0.0255597),(32,'#校园网大规模病毒攻击#','病毒',0.0176313),(33,'#校园网大规模病毒攻击#','校园网',0.0146055),(34,'#校园网大规模病毒攻击#','电脑',0.0112142),(35,'#校园网大规模病毒攻击#','黑客',0.00714412),(36,'#校园网大规模病毒攻击#','网络',0.00688971),(37,'#校园网大规模病毒攻击#','全球',0.00535867),(38,'#校园网大规模病毒攻击#','漏洞',0.00429909),(39,'#校园网大规模病毒攻击#','中国',0.00420948),(40,'#校园网大规模病毒攻击#','支付',0.00413737),(41,'#校园网大规模病毒攻击#','使用',0.00410831),(42,'#校园网大规模病毒攻击#','高校',0.00398023),(43,'#校园网大规模病毒攻击#','发布',0.00378514),(44,'#校园网大规模病毒攻击#','用户',0.00369861),(45,'#校园网大规模病毒攻击#','才能',0.00367436),(46,'#校园网大规模病毒攻击#','目前',0.00364723),(47,'#校园网大规模病毒攻击#','论文',0.00360066),(48,'#校园网大规模病毒攻击#','部分',0.00353065),(49,'#校园网大规模病毒攻击#','提醒',0.0035043),(50,'#校园网大规模病毒攻击#','网络攻击',0.0034575),(51,'#校园网大规模病毒攻击#','端口',0.00342947),(52,'#校园网大规模病毒攻击#','校园',0.00338567),(53,'#校园网大规模病毒攻击#','预防',0.00336052),(54,'#校园网大规模病毒攻击#','爱情',0.00333563),(55,'#校园网大规模病毒攻击#','没有',0.00331454),(56,'#校园网大规模病毒攻击#','软件',0.00326658),(57,'#校园网大规模病毒攻击#','防范',0.00319325),(58,'#校园网大规模病毒攻击#','win10',0.00314993),(59,'#校园网大规模病毒攻击#','国家',0.00305815),(60,'#校园网大规模病毒攻击#','公司',0.00305026);
/*!40000 ALTER TABLE `keywords` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2017-05-27 22:53:32
