-- MySQL dump 10.13  Distrib 5.7.17, for macos10.12 (x86_64)
--
-- Host: localhost    Database: weibodb
-- ------------------------------------------------------
-- Server version	5.7.10

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `keywords`
--

DROP TABLE IF EXISTS `keywords`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `keywords` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `topic` varchar(120) DEFAULT NULL,
  `word` varchar(120) DEFAULT NULL,
  `weight` float DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=301 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `keywords`
--

LOCK TABLES `keywords` WRITE;
/*!40000 ALTER TABLE `keywords` DISABLE KEYS */;
INSERT INTO `keywords` VALUES (1,'#北京电影学院性侵案#','性侵案',0.0158261),(2,'#北京电影学院性侵案#','老师',0.0115027),(3,'#北京电影学院性侵案#','学生',0.00735204),(4,'#北京电影学院性侵案#','北京电影学院',0.00686685),(5,'#北京电影学院性侵案#','没有',0.00497883),(6,'#北京电影学院性侵案#','希望',0.00478932),(7,'#北京电影学院性侵案#','事情',0.00465896),(8,'#北京电影学院性侵案#','现在',0.00454153),(9,'#北京电影学院性侵案#','出来',0.00424213),(10,'#北京电影学院性侵案#','学校',0.00423867),(11,'#北京电影学院性侵案#','阿廖沙',0.00396032),(12,'#北京电影学院性侵案#','知道',0.00380595),(13,'#北京电影学院性侵案#','事件',0.00367812),(14,'#北京电影学院性侵案#','大学',0.00356958),(15,'#北京电影学院性侵案#','社会',0.00323548),(16,'#北京电影学院性侵案#','应该',0.00318013),(17,'#北京电影学院性侵案#','联名',0.00304186),(18,'#北京电影学院性侵案#','世界',0.00300848),(19,'#北京电影学院性侵案#','北影',0.00295761),(20,'#北京电影学院性侵案#','觉得',0.00295535),(21,'#北京电影学院性侵案#','同学',0.00267248),(22,'#北京电影学院性侵案#','相信',0.0026408),(23,'#北京电影学院性侵案#','北电',0.00262204),(24,'#北京电影学院性侵案#','不会',0.00258409),(25,'#北京电影学院性侵案#','受害者',0.00238472),(26,'#北京电影学院性侵案#','恶心',0.00234113),(27,'#北京电影学院性侵案#','法律',0.00227976),(28,'#北京电影学院性侵案#','女生',0.00226675),(29,'#北京电影学院性侵案#','不能',0.00221642),(30,'#北京电影学院性侵案#','受到',0.00212039),(31,'#校园网大规模病毒攻击#','攻击',0.0255597),(32,'#校园网大规模病毒攻击#','病毒',0.0176313),(33,'#校园网大规模病毒攻击#','校园网',0.0146055),(34,'#校园网大规模病毒攻击#','电脑',0.0112142),(35,'#校园网大规模病毒攻击#','黑客',0.00714412),(36,'#校园网大规模病毒攻击#','网络',0.00688971),(37,'#校园网大规模病毒攻击#','全球',0.00535867),(38,'#校园网大规模病毒攻击#','漏洞',0.00429909),(39,'#校园网大规模病毒攻击#','中国',0.00420948),(40,'#校园网大规模病毒攻击#','支付',0.00413737),(41,'#校园网大规模病毒攻击#','使用',0.00410831),(42,'#校园网大规模病毒攻击#','高校',0.00398023),(43,'#校园网大规模病毒攻击#','发布',0.00378514),(44,'#校园网大规模病毒攻击#','用户',0.00369861),(45,'#校园网大规模病毒攻击#','才能',0.00367436),(46,'#校园网大规模病毒攻击#','目前',0.00364723),(47,'#校园网大规模病毒攻击#','论文',0.00360066),(48,'#校园网大规模病毒攻击#','部分',0.00353065),(49,'#校园网大规模病毒攻击#','提醒',0.0035043),(50,'#校园网大规模病毒攻击#','网络攻击',0.0034575),(51,'#校园网大规模病毒攻击#','端口',0.00342947),(52,'#校园网大规模病毒攻击#','校园',0.00338567),(53,'#校园网大规模病毒攻击#','预防',0.00336052),(54,'#校园网大规模病毒攻击#','爱情',0.00333563),(55,'#校园网大规模病毒攻击#','没有',0.00331454),(56,'#校园网大规模病毒攻击#','软件',0.00326658),(57,'#校园网大规模病毒攻击#','防范',0.00319325),(58,'#校园网大规模病毒攻击#','win10',0.00314993),(59,'#校园网大规模病毒攻击#','国家',0.00305815),(60,'#校园网大规模病毒攻击#','公司',0.00305026),(91,'雄安新区','雄安',0.0226875),(92,'雄安新区','新区',0.0182277),(93,'雄安新区','板块',0.00619688),(94,'雄安新区','发展',0.00520129),(95,'雄安新区','市场',0.00462594),(96,'雄安新区','大盘',0.00444347),(97,'雄安新区','建设',0.00378146),(98,'雄安新区','个股',0.00372788),(99,'雄安新区','涨停',0.00336318),(100,'雄安新区','股份',0.00317356),(101,'雄安新区','投资',0.00310352),(102,'雄安新区','河北',0.0030548),(103,'雄安新区','资金',0.00249705),(104,'雄安新区','北京',0.00246812),(105,'雄安新区','今天',0.00234444),(106,'雄安新区','中国',0.0022726),(107,'雄安新区','环保',0.0022111),(108,'雄安新区','创新',0.00219136),(109,'雄安新区','规划',0.00216045),(110,'雄安新区','河北省',0.00212803),(111,'雄安新区','盘面',0.00211844),(112,'雄安新区','今日',0.00196953),(113,'雄安新区','白洋淀',0.00196134),(114,'雄安新区','行情',0.00192592),(115,'雄安新区','没有',0.00190883),(116,'雄安新区','雄县',0.00184194),(117,'雄安新区','目前',0.00176112),(118,'雄安新区','城市',0.00175965),(119,'雄安新区','龙头',0.00173693),(120,'雄安新区','中央',0.00172362),(211,'#新疆塔什库尔干5.5级地震#','地震',0.0272916),(212,'#新疆塔什库尔干5.5级地震#','新疆',0.0144648),(213,'#新疆塔什库尔干5.5级地震#','应急',0.00948728),(214,'#新疆塔什库尔干5.5级地震#','现场',0.0083191),(215,'#新疆塔什库尔干5.5级地震#','喀什',0.00792391),(216,'#新疆塔什库尔干5.5级地震#','灾区',0.00710735),(217,'#新疆塔什库尔干5.5级地震#','地震局',0.00684377),(218,'#新疆塔什库尔干5.5级地震#','开展',0.00646815),(219,'#新疆塔什库尔干5.5级地震#','救援',0.00634923),(220,'#新疆塔什库尔干5.5级地震#','塔县',0.00569432),(221,'#新疆塔什库尔干5.5级地震#','工作',0.00535298),(222,'#新疆塔什库尔干5.5级地震#','人员',0.00509539),(223,'#新疆塔什库尔干5.5级地震#','房屋',0.00507975),(224,'#新疆塔什库尔干5.5级地震#','受灾',0.00485196),(225,'#新疆塔什库尔干5.5级地震#','群众',0.00432741),(226,'#新疆塔什库尔干5.5级地震#','灾情',0.00398439),(227,'#新疆塔什库尔干5.5级地震#','震区',0.00397446),(228,'#新疆塔什库尔干5.5级地震#','工作队',0.00395628),(229,'#新疆塔什库尔干5.5级地震#','目前',0.00391904),(230,'#新疆塔什库尔干5.5级地震#','赶赴',0.00387659),(231,'#新疆塔什库尔干5.5级地震#','救灾',0.00373829),(232,'#新疆塔什库尔干5.5级地震#','震中',0.00370188),(233,'#新疆塔什库尔干5.5级地震#','时间',0.00366231),(234,'#新疆塔什库尔干5.5级地震#','启动',0.0034139),(235,'#新疆塔什库尔干5.5级地震#','今天',0.00338762),(236,'#新疆塔什库尔干5.5级地震#','前往',0.00335385),(237,'#新疆塔什库尔干5.5级地震#','中国',0.00334821),(238,'#新疆塔什库尔干5.5级地震#','调查',0.00325613),(239,'#新疆塔什库尔干5.5级地震#','队员',0.00323949),(240,'#新疆塔什库尔干5.5级地震#','喀什地区',0.00318367),(241,'#台湾美女作家自杀#','自杀',0.0144197),(242,'#台湾美女作家自杀#','没有',0.00752667),(243,'#台湾美女作家自杀#','台湾',0.00576457),(244,'#台湾美女作家自杀#','痛苦',0.00518787),(245,'#台湾美女作家自杀#','孩子',0.00486741),(246,'#台湾美女作家自杀#','社会',0.00459521),(247,'#台湾美女作家自杀#','资源网',0.00436843),(248,'#台湾美女作家自杀#','事情',0.00356745),(249,'#台湾美女作家自杀#','房思琪',0.00324212),(250,'#台湾美女作家自杀#','不能',0.00308681),(251,'#台湾美女作家自杀#','教育',0.00307044),(252,'#台湾美女作家自杀#','乐园',0.00302995),(253,'#台湾美女作家自杀#','经历',0.00298772),(254,'#台湾美女作家自杀#','感觉',0.0029636),(255,'#台湾美女作家自杀#','看到',0.00290388),(256,'#台湾美女作家自杀#','老师',0.00289536),(257,'#台湾美女作家自杀#','小说',0.00289302),(258,'#台湾美女作家自杀#','选择',0.00282848),(259,'#台湾美女作家自杀#','内心',0.00278937),(260,'#台湾美女作家自杀#','诱奸',0.00272185),(261,'#台湾美女作家自杀#','应该',0.00245633),(262,'#台湾美女作家自杀#','认识',0.0023352),(263,'#台湾美女作家自杀#','世界',0.00224211),(264,'#台湾美女作家自杀#','方式',0.00216386),(265,'#台湾美女作家自杀#','离开',0.00216088),(266,'#台湾美女作家自杀#','视频',0.00214021),(267,'#台湾美女作家自杀#','阅读',0.00208553),(268,'#台湾美女作家自杀#','大家',0.00202238),(269,'#台湾美女作家自杀#','希望',0.00201582),(270,'#台湾美女作家自杀#','美女作家',0.00199787),(271,'#摔跤吧爸爸#','爸爸',0.0260232),(272,'#摔跤吧爸爸#','电影',0.0186146),(273,'#摔跤吧爸爸#','印度',0.00958609),(274,'#摔跤吧爸爸#','摔跤',0.0093227),(275,'#摔跤吧爸爸#','父亲',0.00629831),(276,'#摔跤吧爸爸#','没有',0.00618137),(277,'#摔跤吧爸爸#','梦想',0.00509484),(278,'#摔跤吧爸爸#','女儿',0.0047293),(279,'#摔跤吧爸爸#','孩子',0.00385938),(280,'#摔跤吧爸爸#','好看',0.0038591),(281,'#摔跤吧爸爸#','阿米尔',0.0033972),(282,'#摔跤吧爸爸#','励志',0.00328658),(283,'#摔跤吧爸爸#','感动',0.00297648),(284,'#摔跤吧爸爸#','感受',0.00291614),(285,'#摔跤吧爸爸#','现在',0.00275707),(286,'#摔跤吧爸爸#','看到',0.00271714),(287,'#摔跤吧爸爸#','故事',0.00265638),(288,'#摔跤吧爸爸#','比赛',0.00253756),(289,'#摔跤吧爸爸#','训练',0.00249385),(290,'#摔跤吧爸爸#','女权',0.00231011),(291,'#摔跤吧爸爸#','演员',0.00228663),(292,'#摔跤吧爸爸#','父爱',0.00225644),(293,'#摔跤吧爸爸#','社会',0.00225022),(294,'#摔跤吧爸爸#','影片',0.00219883),(295,'#摔跤吧爸爸#','体育',0.00205314),(296,'#摔跤吧爸爸#','今天',0.00197649),(297,'#摔跤吧爸爸#','泪点',0.00188819),(298,'#摔跤吧爸爸#','完成',0.00188575),(299,'#摔跤吧爸爸#','剧情',0.00182859),(300,'#摔跤吧爸爸#','人生',0.00180038);
/*!40000 ALTER TABLE `keywords` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2017-05-31 12:14:55
